#config
#集中管理路徑

from pathlib import Path

BASE_DIR = Path(r"C:\Users\Administrator\Desktop\SCAN")

POPPLER_PATH = (
    r"C:\Users\Administrator\OneDrive\自動化公文歸檔"
    r"\poppler-25.12.0\Library\bin"
)

EXCEL_MAPPING = {

    # =====================
    # 八里
    # =====================
    ("八里", "公所"):
    r"\\Dabs-nas2\新公用區\115年八里工務\115八里機關來文.xlsx",

    ("八里", "廠商"):
    r"\\Dabs-nas2\新公用區\115年八里工務\115八里廠商來文.xlsx",

    # =====================
    # 五股
    # =====================
    ("五股", "公所"):
    r"\\Dabs-nas2\新公用區\115年五股經建\115五股經建機關來文登錄表.xlsx",

    ("五股", "廠商"):
    r"\\Dabs-nas2\新公用區\115年五股經建\115五股經建廠商來文登錄表.xlsx",

    # =====================
    # 林口
    # =====================
    ("林口", "公所"):
    r"\\Dabs-nas2\新公用區\115林口經建(專案)\115林口機關來文登錄表.xlsx",
    ("林口", "廠商"):
    r"\\Dabs-nas2\新公用區\115林口經建(專案)\115林口廠商來文登錄表.xlsx",
    # =====================
    # 蘆洲
    # =====================
    ("蘆洲", "公所"):
    r"\\Dabs-nas2\新公用區\115蘆洲經建\115蘆洲機關來文登錄表.xlsx",

    ("蘆洲", "廠商"):
    r"\\Dabs-nas2\新公用區\115蘆洲經建\115蘆洲廠商來文登錄表.xlsx",
}