#rules.py
#分類規則管理
AREA_KEYWORDS = {

    "八里": [
        "八里區",
        "八里",
        "文昌",
        "舊城"

    ],

    "五股": [
        "五股區",
        "五股"
    ],

    "蘆洲": [
        "蘆洲區",
        "蘆洲"
    ],

    "林口": [
        "林口區",
        "林口"
    ]
}
AREA_SECOND_RULES = {

     "八里": {

        "北區": ["北區" ],

        "南區": ["南區","反光鏡","溝頂板" ],
        
        "路養": [ "路面","養護", "鑽心", "鋪面" ],
        
        "搶災": [ "災害", "預防","搶修" ],

        "雨水": ["雨水","箱涵", "下水道"],
        "排水": [  "河道", "清疏", "區域排水","其他排水",
            "側溝", "橫越管", "排水維護" ],
        "天花板": ["天花板"],
        "公園": [ "公園" ],
        "照明": ["照明" ],
        "技服": [  "技術服務" , "技術", "服務" ],

        "民間興闢": ["民間" , "興闢" ]
        },
    


    "五股": {

        "綠美化A": ["第1區","第一區","1區", "一區"  ],

        "綠美化B": ["第2區", "第二區","2區","二區"],

        "天幕": ["天幕", "運動天幕" ],

        "體健": [ "體健", "遊樂"  ],
        "公園": [ "公園", "公園設施"  ],
        "樹木搶災": ["樹木" , "搶災" ],  
        "技服": [ "技術服務" , "技術", "服務" ]
    },


    "林口": {
        
        "技服": ["技術服務" , "技術", "服務"],
        "公園": ["公園","婦幼","西林","天幕","寶林","籃球場"]},

    "蘆洲": {

        "土木": ["公園","廣場", "體健","遊具"  ],
        "技服": ["技術服務" , "技術","服務"  ],
        "水電照明": [ "水電" , "照明" ], 
        "綠美": [  "綠美化" , "樹木","搶災"]
    }
}